'''
    ตัวดำเนินการเปรียบเทียบ
    มีข้อมูลอย่างน้อย 2 ตัวขึ้นไป
    ชนิดข้อมูลเหมือนกัน
    ผลลัพธ์การเปรียบเทียบจะได้แค่ True, False

    เครื่องหมายการเปรียบเทียบ
    == เท่ากับ
    != ไม่เท่ากับ
    > มากกว่า
    < น้อยกว่า
    >= มากกว่าหรือเท่ากับ
    <= น้อยกว่าหรือเท่ากับ
'''

x = 10
y = 15
print("x=",x, "\t y=",y)
print("----------------")

print("x = y : " , x==y)
print("x != y : " , x!=y)
print("x > y : " , x>y)
print("x < y : " , x<y)
print("x >= y : " , x>=y)
print("x <= y : " , x<=y)
